erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСклад/СХК_МобильныйСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СХК_МобильныйСклад</name>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/InformationRegisters/СХК_ВыпускПоЭтапу/СХК_ВыпускПоЭтапу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СХК_ВыпускПоЭтапу</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопКоличество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СХК_СтатусВыпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопУпаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопВыпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СерииНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭтапПроизводства</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСтрокиДок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Линия</name>
    <type>
      <types>EnumRef.СХКТруд_Линии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

erpdev.СХК_Расширение/src/Enums/СХК_СтатусВыпуска/СХК_СтатусВыпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СХК_СтатусВыпуска</name>
  <enumValues>
    <name>ПринятНаСклад</name>
  </enumValues>
  <enumValues>
    <name>Собран</name>
  </enumValues>
</mdclass:Enum>

erpdev.СХК_Расширение/src/Catalogs/СХК_СкладЯчейки/СХК_СкладЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СХК_СкладЯчейки</name>
  <attributes>
    <name>Ряд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВМестимость</name>
    <type>
      <types>EnumRef.СХК_ВМестимость</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Блокировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСклад/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ОткрытьФормуВыбор(ИмяФормы,СтруктураПараметры)
	
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(СтруктураПараметры,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма."+ИмяФормы, _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьКоличество();  
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если НЕ МобильныйКлиент Тогда
		Если ПроверитьРоль() Тогда 
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);
			ПоказатьПредупреждение(Оповещение,"Вход разрешен только с ТСД ",5,Строка("Ошибка"));
			
			
		КонецЕсли;
	#КонецЕсли
	
	ПодключитьОбработчикОжидания("ОбработчикГП", 60); 

КонецПроцедуры   

&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Параметры) Экспорт  
	ЗавершитьРаботуСистемы(Ложь);
КонецПроцедуры

&НаСервере
Функция ПроверитьРоль()
	Если РольДоступна("СХК_ТСД") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура ОбработчикГП()    

	УстановитьКоличество();
	
КонецПроцедуры

&НаСервере 
Процедура УстановитьКоличество() 
	СкладПолучатель = Новый	Массив;
	//СкладПолучатель.Добавить(Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции"));
  
	
	ТекП = Пользователи.АвторизованныйПользователь();
	
	//Если ТекП.Наименование = "tsd1" Тогда
	//	СкладПолучатель.Добавить(Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции"));
	//ИначеЕсли ТекП.Наименование = "tsd2" Тогда 
	//	СкладПолучатель.Добавить(Справочники.Склады.НайтиПоНаименованию("ЦК Цех Комплектации")); 
	//	ЭтаФорма.Элементы.ГруппаРазмещение.Видимость = Ложь;
	//КонецЕсли;
	
		СкладПолучатель.Добавить(Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции"));
		СкладПолучатель.Добавить(Справочники.Склады.НайтиПоНаименованию("ЦК Цех Комплектации")); 
		
	Если ТекП.Наименование = "tsd2" Тогда 
		ЭтаФорма.Элементы.ГруппаРазмещение.Видимость = Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	СХК_ВыпускПоЭтапу.Период КАК Период,
	              |	СХК_ВыпускПоЭтапу.ЭтапПроизводства КАК ЭтапПроизводства,
	              |	СХК_ВыпускПоЭтапу.СкладПолучатель КАК СкладПолучатель,
	              |	СХК_ВыпускПоЭтапу.Количество КАК Количество,
	              |	СХК_ВыпускПоЭтапу.Статус КАК Статус,
	              |	СХК_ВыпускПоЭтапу.Упаковка КАК Упаковка,
	              |	СХК_ВыпускПоЭтапу.НомерСтрокиДок КАК НомерСтрокиДок
	              |ИЗ
	              |	РегистрСведений.СХК_ВыпускПоЭтапу КАК СХК_ВыпускПоЭтапу
	              |ГДЕ
	              //|	СХК_ВыпускПоЭтапу.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	              |	СХК_ВыпускПоЭтапу.Статус В (ЗНАЧЕНИЕ(Перечисление.СХК_СтатусВыпуска.Собран))
	              |	И СХК_ВыпускПоЭтапу.СкладПолучатель В(&СкладПолучатель)"; 
	
	 Запрос.УстановитьПараметр("СкладПолучатель",СкладПолучатель);
	 Результат = Запрос.Выполнить().Выбрать();
	 
	 Если Результат.Количество() >= 1 ТОгда
		 ЭтаФорма.Элементы.КолП.Заголовок =Результат.Количество();
	 КонецЕсли;   
/////////////////	 
	Б = Справочники.СХК_СкладЯчейки.НайтиПоНаименованию("Буфер");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК Количество,
	               |	СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
	               |	СХК_ТоварыНаСкладеОстатки.Серия КАК Серия
	               |ИЗ
	               |	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
	               |ГДЕ
	               |	СХК_ТоварыНаСкладеОстатки.Ячейка.Наименование = &Ячейка"; 
	Запрос.УстановитьПараметр("Ячейка","Буфер");
	
	Результат = Запрос.Выполнить();
	СпособОбхода = ОбходРезультатаЗапроса.Прямой;
	ТабЗнач = Результат.Выгрузить(СпособОбхода);	
	 Если ТабЗнач.Количество() >= 1 ТОгда
		 ЭтаФорма.Элементы.КолП1.Заголовок =ТабЗнач.Количество();
	 КонецЕсли;   
	
	
	 
	 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПоступление(Команда)
	ПараметрыФормыОстатки = Новый Структура;
	//Теперь помещаем эти данные в хранилище и получаем адрес этого хранилища
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	//Создаем структуру с параметрами, которые передадим во вторую форму
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.ФормаПоступления", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры     


 &НаКлиенте
Процедура ОбработатьЗакрытиеФормыНовыйЗаказ(Значение, ДопПараметры) Экспорт
	УстановитьКоличество();	
КонецПроцедуры


&НаКлиенте
Процедура Размещение(Команда)
 	ПараметрыФормыОстатки = Новый Структура;
	//Теперь помещаем эти данные в хранилище и получаем адрес этого хранилища
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	//Создаем структуру с параметрами, которые передадим во вторую форму
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
	ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.ФормаПеремещение", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры


&НаКлиенте
Процедура Отгрузка(Команда)
	СтруктураПараметры = Новый Структура;
	ОткрытьФормуВыбор("СписокОрдеров",СтруктураПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияОЯчейки(Команда)
	СтруктураПараметры = Новый Структура;
	ОткрытьФормуВыбор("ФормаИнформация",СтруктураПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура Инвентаризация(Команда)
	
	СтруктураПараметры = Новый Структура;
	ОткрытьФормуВыбор("ФормаИнвентаризация",СтруктураПараметры);

КонецПроцедуры
